/*#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");
    int array[10][10] = {
        {23, 96, 3, 62, 59, 10, 73, 30, 10, 81},
        {44, 3, 99, 88, 53, 90, 42, 39, 36, 98},
        {39, 32, 5, 8, 34, 9, 39, 95, 36, 41},
        {33, 79, 22, 99, 29, 61, 65, 48, 70, 77},
        {73, 49, 40, 39, 16, 49, 68, 37, 60, 10},
        {98, 65, 67, 11, 14, 39, 74, 29, 70, 81},
        {29, 90, 63, 44, 5, 4, 5, 28, 22, 94},
        {88, 100, 15, 75, 42, 68, 50, 8, 98, 55},
        {38, 21, 77, 25, 91, 92, 64, 72, 16, 67},
        {65, 93, 45, 52, 51, 19, 96, 45, 7, 39}
    };
    // Вывод  матрицы
    cout << "Исходная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
    // Сложение элементов по вертикали
    for (int i = 8; i >= 0; i--)
    {
        array[i][0] += array[i + 1][0];
    }
    // Сложение элементов по горизонтали
    for (int j = 1; j < 10; j++)
    {
        array[9][j] += array[9][j - 1];
    }
    // Сложение элементов по диагонали
    for (int i = 8; i >= 0; i--)
    {
        for (int j = 1; j < 10; j++)
        {
            int maxElement = max(array[i][j-1], array[i+1][j]);
            array[i][j] += maxElement;
        }
    }
    // Вывод измененной матрицы
    cout << endl << "Измененная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
}*/

/*#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");
    int array[10][10] = {
        {23, 96, 3, 62, 59, 10, 73, 30, 10, 81},
        {44, 3, 99, 88, 53, 90, 42, 39, 36, 98},
        {39, 32, 5, 8, 34, 9, 39, 95, 36, 41},
        {33, 79, 22, 99, 29, 61, 65, 48, 70, 77},
        {73, 49, 40, 39, 16, 49, 68, 37, 60, 10},
        {98, 65, 67, 11, 14, 39, 74, 29, 70, 81},
        {29, 90, 63, 44, 5, 4, 5, 28, 22, 94},
        {88, 100, 15, 75, 42, 68, 50, 8, 98, 55},
        {38, 21, 77, 25, 91, 92, 64, 72, 16, 67},
        {65, 93, 45, 52, 51, 19, 96, 45, 7, 39}
    };
    // Вывод  матрицы
    cout << "Исходная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
    // Сложение элементов по вертикали
    for (int i = 8; i >= 0; i--)
    {
        array[i][0] += array[i + 1][0];
    }
    // Сложение элементов по горизонтали
    for (int j = 1; j < 10; j++)
    {
        array[9][j] += array[9][j - 1];
    }
    // Сложение элементов по диагонали
    for (int i = 8; i >= 0; i--)
    {
        for (int j = 1; j < 10; j++)
        {
            int minElement = min(array[i][j-1], array[i+1][j]);
            array[i][j] += minElement;
        }
    }
    // Вывод измененной матрицы
    cout << endl << "Измененная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
}*/

/*#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");
    int array[4][4] = {
        {42, 90, 2, 44},
        {72, 30, 36, 63},
        {62, 6, 61, 42},
        {21, 84, 49, 50},
    };

    // Вывод  матрицы
    cout << "Исходная таблица:" << endl;
    for (int i = 0; i < 4; i++)
    {
        for (int j = 0; j < 4; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }

    // Сложение элементов по вертикали
    for (int i = 1; i < 4; i++)
    {
        array[i][0] += array[i - 1][0];
    }

    // Сложение элементов по горизонтали
    for (int j = 1; j < 4; j++)
    {
        array[0][j] += array[0][j - 1];
    }

    // Сложение элементов по диагонали
    for (int i = 1; i < 4; i++)
    {
        for (int j = 1; j < 4; j++)
        {
            int maxElement = max(array[i][j - 1], array[i - 1][j]);
            int maxX = max(maxElement, array[i - 1][j - 1]);
            int MaxO = max();
            array[i][j] += MaxO;
        }
    }

    // Вывод измененной матрицы
    cout << endl << "Измененная таблица:" << endl;
    for (int i = 0; i < 4; i++)
    {
        for (int j = 0; j < 4; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
}*/


#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");
    int array[10][10] = {
        {86, 40, 41, 13, 91, 96, 88, 42, 73, 51},
        {96, 23, 6, 19, 58, 80, 63, 32, 31, 1},
        {98, 86, 89, 60, 36, 95, 35, 22, 30, 82},
        {82, 99, 97, 83, 92, 52, 64, 58, 5, 53},
        {22, 77, 70, 43, 92, 86, 27, 3, 28, 51},
        {21, 7, 99, 20, 6, 62, 30, 43, 18, 34},
        {35, 80, 43, 99, 97, 71, 75, 40, 39, 89},
        {15, 43, 83, 20, 94, 33, 11, 24, 72, 85},
        {39, 77, 81, 91, 41, 9, 1, 57, 86, 45},
        {17, 69, 29, 85, 33, 69, 100, 69, 19, 75}
    };

    // Вывод исходной матрицы
    cout << "Исходная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }

    // Сложение элементов по вертикали
    for (int i = 1; i < 10; i++)
    {
        array[i][0] += array[i - 1][0];
    }

    // Сложение элементов по горизонтали
    for (int j = 1; j < 10; j++)
    {
        array[0][j] += array[0][j - 1];
    }

    // Сложение элементов по диагонали
    for (int i = 1; i < 10; i++)
    {
        for (int j = 1; j < 10; j++)
        {
            int maxElement = max(array[i][j - 1], array[i - 1][j]);
            array[i][j] += maxElement;
        }
    }

    // Вывод измененной матрицы
    cout << endl << "Измененная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }

    return 0;
}
